Configuration/Documents/бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Documents/бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ бит_ум_УчетМигрантовСервер.ПолучитьЛицензию(Истина) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	КадровыйУчетФормы.ФормаКадровогоДокументаПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов	
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		УстановитьФункциональныеОпцииФормы();
		ЗаполнитьОтветственногоПоИностраннымРаботникам();
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			ОрганизацияПриИзмененииНаСервере();
		КонецЕсли;		
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом	
	
 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом	

	УстановитьСостояниеДокумента();
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ПослеЗаписиНаСервере(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
 	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
 	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьСотрудников

&НаКлиенте
Процедура ПереченьСотрудниковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СотрудникиОбработкаВыбораНаСервере(ВыбранноеЗначение);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элементы.ПереченьСотрудников,
		Объект.Организация,
		,
		Объект.Дата,
		Истина,
		АдресСпискаПодобранныхСотрудников());

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСотрудникамиИмеющимиПатент(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект, "Организация");
		Возврат;
	КонецЕсли;
		
	Если Объект.ПереченьСотрудников.Количество() > 0 Тогда
		
		Если Объект.Проведен Тогда
			ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено, а табличная часть будет очищена. Заполнить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		КонецЕсли;

		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьСотрудникамиИмеющимиПатент", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ЗаполнитьСотрудникамиИмеющимиПатентНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОшибкаВыгрузки = Ложь;
	
	ТекстВыгрузкиВXML = "";
	
	Если НЕ УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузкиВXML) Тогда
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
				
		ПутьВыгрузки = РегламентированнаяОтчетностьКлиент.ПолучитьПутьВыгрузки();
		Если ПутьВыгрузки = Ложь Тогда
			ОшибкаВыгрузки = Истина;
			Возврат;
		КонецЕсли;
				
	#КонецЕсли
	
	ИмяКонечногоФайла = ИзвлечьИмяФайлаИзТекстаXML(ТекстВыгрузкиВXML);
	
	Если НЕ ПустаяСтрока(ИмяКонечногоФайла) Тогда
		
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(ТекстВыгрузкиВXML);
		
		КодировкаТекстаВыгрузки = "windows-1251";

		Попытка
			
			АдресФайлаВыгрузки = Неопределено;
			
			#Если ВебКлиент Тогда
				
				ПолучитьФайл(ПоместитьФайлВыгрузкиВоВременноеХранилищеНаСервере(
					Текст, ИмяКонечногоФайла, КодировкаТекстаВыгрузки), ИмяКонечногоФайла, Истина);
				
			#Иначе
				
				ИмяВременногоФайла = КаталогВременныхФайлов() + ИмяКонечногоФайла;
				ПолноеИмяКонечногоФайла = ПутьВыгрузки + ИмяКонечногоФайла;
				
				Если АдресФайлаВыгрузки <> Неопределено Тогда
					ДвоичныйФайл = ПолучитьИзВременногоХранилища(АдресФайлаВыгрузки);
					ДвоичныйФайл.Записать(ИмяВременногоФайла);
				Иначе
					Текст.Записать(ИмяВременногоФайла, КодировкаТекстаВыгрузки);
				КонецЕсли;
				
				ПереместитьФайл(ИмяВременногоФайла, ПолноеИмяКонечногоФайла);
				
				ТекстСообщения = НСтр("ru = 'Файл выгрузки регламентированного отчета ""%1"" сохранен в каталог ""%2"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяКонечногоФайла, ПутьВыгрузки);  
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(НСтр("ru='%1'"), ТекстСообщения);
				Сообщение.Сообщить();
		
			#КонецЕсли
					
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru='Не удалось записать файл ""%1""! Возможно, недостаточно места на диске или диск защищен от записи.'"),
				ИмяКонечногоФайла);
			Сообщение.Сообщить();
			
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ЗарплатаКадрыПодсистемы.ПодписиДокументов
&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементПриИзменении(Элемент)
	
	ПодписиДокументовКлиент.ПриИзмененииПодписывающегоЛица(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементНажатие(Элемент)
	
	ПодписиДокументовКлиент.РасширеннаяПодсказкаНажатие(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры
// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов

#Область ВыгрузкаОтчетаВФайл

&НаКлиенте
Функция ИзвлечьИмяФайлаИзТекстаXML(Знач ТекстXML)
	
	ИмяФайла = "";
	ВхождениеИдФайл = СтрНайти(ТекстXML, " ИдФайл");
	Если ВхождениеИдФайл <> 0 Тогда
		ТекстXML = Сред(ТекстXML, ВхождениеИдФайл);
		ВхождениеПервойКавычки = СтрНайти(ТекстXML, """");
		Если ВхождениеПервойКавычки <> 0 Тогда
			ТекстXML = Сред(ТекстXML, ВхождениеПервойКавычки + 1);
			ВхождениеВторойКавычки = СтрНайти(ТекстXML, """");
			Если ВхождениеВторойКавычки <> 0 Тогда
				ИмяФайла = СокрЛП(Лев(ТекстXML, ВхождениеВторойКавычки - 1)) + ".xml";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ИмяФайла;
	
КонецФункции

&НаСервере
Функция УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки)
	
	Возврат бит_ум_УчетМигрантовСервер.ВыгрузкаВXMLЗаявленияНаУменьшениеСуммыНДФЛ(Объект.Ссылка, ТекстВыгрузки);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоместитьФайлВыгрузкиВоВременноеХранилищеНаСервере(Текст, ТекСтрИмяФайла, КодировкаТекста, УникальныйИДФормы = Неопределено)
		
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("tmp");
		
	Текст.Записать(ИмяВременногоФайла, КодировкаТекста);	
	
	ФайлВыгрузки = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	Адрес = ПоместитьВоВременноеХранилище(ФайлВыгрузки, ?(ЗначениеЗаполнено(УникальныйИДФормы) = Истина, УникальныйИДФормы, Новый УникальныйИдентификатор()));
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Адрес;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Функция СостояниеДокумента(Объект)
	
	РучнаяКорректировка = Неопределено;
	
	Если Объект.ПометкаУдаления Тогда
		СостояниеДокумента = 2;
	ИначеЕсли Объект.Проведен Тогда
		СостояниеДокумента = 1;
	Иначе
		СостояниеДокумента = 0;
	КонецЕсли;
	
	Возврат СостояниеДокумента;
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	ЗаполнитьОтветственногоПоИностраннымРаботникам();
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ЗаполнитьПодписиПоОрганизации(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация, Период", Объект.Организация, Объект.Дата);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственногоПоИностраннымРаботникам()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Оформил = бит_ум_УчетМигрантовСервер.ПолучитьОтветственноеЛицо(Объект.Организация, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьСотрудникамиИмеющимиПатент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСотрудникамиИмеющимиПатентНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСотрудникамиИмеющимиПатентНаКлиенте()
	
	ДлительнаяОперация = НачатьЗаполнениеТаблицыПереченьСотрудников();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения =
		НСтр("ru = 'Выполняется заполнение документа ""Заявление на уменьшение суммы НДФЛ"".'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьСотрудникамиИмеющимиПатентЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСотрудникамиИмеющимиПатентЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗагрузитьПодготовленныеДанные(Результат.АдресРезультата);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'"),
			ОбщегоНазначенияКлиент.ДатаСеанса(), Результат.ПодробноеПредставлениеОшибки));
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеТаблицыПереченьСотрудников()
	
	ПараметрыПроцедуры = Новый Структура("Организация, Дата, Проведен");
	ЗаполнитьЗначенияСвойств(ПараметрыПроцедуры, Объект);
	
	Если ПараметрыПроцедуры.Проведен Тогда 
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
	Объект.ПереченьСотрудников.Очистить();
	
	ТаблицаПереченьСотрудников = Объект.ПереченьСотрудников.Выгрузить();
	ТаблицаПереченьСотрудников.Очистить();

	ПараметрыПроцедуры.Вставить("ТаблицаПереченьСотрудников", ТаблицаПереченьСотрудников);

	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение документа ""Заявление на уменьшение суммы НДФЛ""'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.бит_ум_ЗаявлениеНаУменьшениеСуммыНДФЛ.ПодготовитьДанныеДляЗаполнения", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные(АдресРезультата)

	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;                           

	Если СтруктураДанных.Свойство("ТаблицаПереченьСотрудников") Тогда
		Объект.ПереченьСотрудников.Загрузить(СтруктураДанных.ТаблицаПереченьСотрудников);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ПереченьСотрудников.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура СотрудникиОбработкаВыбораНаСервере(ВыбранныеСотрудники)
	
	Если ТипЗнч(ВыбранныеСотрудники) = Тип("Массив") Тогда
		СписокСотрудников = ВыбранныеСотрудники;
	Иначе
		СписокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныеСотрудники);
	КонецЕсли;
	
	ДобавляемыеСотрудники = Новый Массив;
	Для Каждого Сотрудник Из СписокСотрудников Цикл
		
		Если Объект.ПереченьСотрудников.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		ДобавляемыеСотрудники.Добавить(Сотрудник);
		
	КонецЦикла;
	
	Для каждого ДобавляемыйСотрудник Из ДобавляемыеСотрудники Цикл
		
		НоваяСтрокаСотрудников = Объект.ПереченьСотрудников.Добавить();
		НоваяСтрокаСотрудников.Сотрудник = ДобавляемыйСотрудник;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
